tests/regression_tests/expression_bdd_dot_diagnostics/xor_mn.dot
digraph bdd {
  rankdir=TB;
  bgcolor="white";
  "node000" [label = "m", fillcolor = "#fff5f5", fontcolor = "#000000", name = "node000", shape = "circle", style = "filled"];
  "node001" [label = "n", fillcolor = "#fff5f5", fontcolor = "#000000", name = "node001", shape = "circle", style = "filled"];
  "node002" [label = "n", fillcolor = "#fff5f5", fontcolor = "#000000", name = "node002", shape = "circle", style = "filled"];
  "node003" [label = "1", fillcolor = "lightgray", name = "node003", shape = "box", style = "filled"];
  "node004" [label = "0", fillcolor = "lightgray", name = "node004", shape = "box", style = "filled"];
  "node000" -> "node001" [color = "#000000", style = "dashed"];
  "node000" -> "node002" [color = "#000000", style = "solid"];
  "node001" -> "node003" [color = "#000000", style = "solid"];
  "node001" -> "node004" [color = "#000000", style = "dashed"];
  "node002" -> "node003" [color = "#000000", style = "dashed"];
  "node002" -> "node004" [color = "#000000", style = "solid"];
}
